Hi @mobilesuitzero and @neurostream, I've taken a moment to test this scenario on the following:

```console
❯ terraform version
Terraform v1.1.4
on darwin_amd64
+ provider registry.terraform.io/hashicorp/vsphere v2.0.2
```

Teraform: v1.1.4
Terraform Provider for vSphere: v2.0.2
VMware vSphere: v7.0.2

For the example, I've used the Ubuntu 20.04 LTS [cloud-image](http://cloud-images.ubuntu.com/focal/current/focal-server-cloudimg-amd64.ova) since the original description did not describe the OVF/OVA used.

Here in the first example, I'm doing a basic deployment of the .ova from a remote URL using the newer `vsphere_ovf_vm_template` data source method in the provider to gather its details.

`main.tf`

```hcl
terraform {
  required_providers {
    vsphere = {
      source  = "hashicorp/vsphere"
      version = ">= 2.0.2"
    }
  }
  required_version = ">= 1.1.4"
}

provider "vsphere" {
  vsphere_server       = "m01-vc01.rainpole.io"
  user                 = "administrator@vsphere.local"
  password             = "VMware1!"
  allow_unverified_ssl = true
}

data "vsphere_datacenter" "datacenter" {
  name = "m01-dc01"
}

data "vsphere_datastore" "vm_datastore" {
  name          = "local-ssd-01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_datastore" "iso_datastore" {
  name          = "local-hdd-01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_compute_cluster" "cluster" {
  name          = "m01-cl01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_resource_pool" "pool" {
  name          = format("%s%s", data.vsphere_compute_cluster.cluster.name, "/Resources")
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_host" "host" {
  name          = "m01-esx01.rainpole.io"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_network" "network" {
  name          = "DHCP"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_ovf_vm_template" "ovf" {
  name             = "ubuntu-20-04-lts"
  resource_pool_id = data.vsphere_resource_pool.pool.id
  datastore_id     = data.vsphere_datastore.vm_datastore.id
  host_system_id   = data.vsphere_host.host.id
  remote_ovf_url   = "http://cloud-images.ubuntu.com/focal/current/focal-server-cloudimg-amd64.ova"
  ovf_network_map = {
    "VM Network" : data.vsphere_network.network.id
  }
}

resource "vsphere_virtual_machine" "ubuntu" {
  name                 = "ubuntu-20-04"
  resource_pool_id     = data.vsphere_resource_pool.pool.id
  datastore_id         = data.vsphere_datastore.vm_datastore.id
  datacenter_id        = data.vsphere_datacenter.datacenter.id
  host_system_id       = data.vsphere_host.host.id
  num_cpus             = data.vsphere_ovf_vm_template.ovf.num_cpus
  num_cores_per_socket = data.vsphere_ovf_vm_template.ovf.num_cores_per_socket
  memory               = data.vsphere_ovf_vm_template.ovf.memory
  guest_id             = data.vsphere_ovf_vm_template.ovf.guest_id
  nested_hv_enabled    = data.vsphere_ovf_vm_template.ovf.nested_hv_enabled
  dynamic "network_interface" {
    for_each = data.vsphere_ovf_vm_template.ovf.ovf_network_map
    content {
      network_id = network_interface.value
    }
  }
  wait_for_guest_net_timeout = 0
  wait_for_guest_ip_timeout  = 0

 cdrom {
     client_device  = true
  }

  ovf_deploy {
    allow_unverified_ssl_cert = true
    remote_ovf_url            = "http://cloud-images.ubuntu.com/focal/current/focal-server-cloudimg-amd64.ova"
    disk_provisioning         = "thin"
    ip_protocol               = "IPV4"
    ip_allocation_policy      = "STATIC_MANUAL"
    ovf_network_map           = data.vsphere_ovf_vm_template.ovf.ovf_network_map
  }
  vapp {
    properties = {
      "hostname" = "ubuntu-20-04",
      "password" = "VMware1!"
    }
  }
}
```

Notice that I've only set it to use the client device:

```hcl
resource "vsphere_virtual_machine" "ubuntu" {
 #... 
 cdrom {
     client_device  = true
  }
 #... 
```

This deploys without issue and attached the client device to the virtual machine (it's needed for cloud-init in this particular .ova)

Here's the result:

<img width="1220" alt="image" src="https://user-images.githubusercontent.com/7771363/151052698-dbce23fd-61c7-465a-b79e-ea986dce2aaf.png">

Alright, the first test is done, and I destroy this example run.

In the next test, I use the following:

`main.tf`

```hcl
terraform {
  required_providers {
    vsphere = {
      source  = "hashicorp/vsphere"
      version = ">= 2.0.2"
    }
  }
  required_version = ">= 1.1.4"
}

provider "vsphere" {
  vsphere_server       = "m01-vc01.rainpole.io"
  user                 = "administrator@vsphere.local"
  password             = "VMware1!"
  allow_unverified_ssl = true
}

data "vsphere_datacenter" "datacenter" {
  name = "m01-dc01"
}

data "vsphere_datastore" "vm_datastore" {
  name          = "local-ssd-01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_datastore" "iso_datastore" {
  name          = "local-hdd-01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_compute_cluster" "cluster" {
  name          = "m01-cl01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_resource_pool" "pool" {
  name          = format("%s%s", data.vsphere_compute_cluster.cluster.name, "/Resources")
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_host" "host" {
  name          = "m01-esx01.rainpole.io"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_network" "network" {
  name          = "DHCP"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_ovf_vm_template" "ovf" {
  name             = "ubuntu-20-04-lts"
  resource_pool_id = data.vsphere_resource_pool.pool.id
  datastore_id     = data.vsphere_datastore.vm_datastore.id
  host_system_id   = data.vsphere_host.host.id
  remote_ovf_url   = "http://cloud-images.ubuntu.com/focal/current/focal-server-cloudimg-amd64.ova"
  ovf_network_map = {
    "VM Network" : data.vsphere_network.network.id
  }
}

resource "vsphere_virtual_machine" "ubuntu" {
  name                 = "ubuntu-20-04"
  resource_pool_id     = data.vsphere_resource_pool.pool.id
  datastore_id         = data.vsphere_datastore.vm_datastore.id
  datacenter_id        = data.vsphere_datacenter.datacenter.id
  host_system_id       = data.vsphere_host.host.id
  num_cpus             = data.vsphere_ovf_vm_template.ovf.num_cpus
  num_cores_per_socket = data.vsphere_ovf_vm_template.ovf.num_cores_per_socket
  memory               = data.vsphere_ovf_vm_template.ovf.memory
  guest_id             = data.vsphere_ovf_vm_template.ovf.guest_id
  nested_hv_enabled    = data.vsphere_ovf_vm_template.ovf.nested_hv_enabled
  dynamic "network_interface" {
    for_each = data.vsphere_ovf_vm_template.ovf.ovf_network_map
    content {
      network_id = network_interface.value
    }
  }
  wait_for_guest_net_timeout = 0
  wait_for_guest_ip_timeout  = 0

  cdrom {
     client_device  = false
     datastore_id = data.vsphere_datastore.iso_datastore.id
     path = "iso/linux/ubuntu/ubuntu-20.04.3-live-server-amd64.iso"
  }

  ovf_deploy {
    allow_unverified_ssl_cert = true
    remote_ovf_url            = "http://cloud-images.ubuntu.com/focal/current/focal-server-cloudimg-amd64.ova"
    disk_provisioning         = "thin"
    ip_protocol               = "IPV4"
    ip_allocation_policy      = "STATIC_MANUAL"
    ovf_network_map           = data.vsphere_ovf_vm_template.ovf.ovf_network_map
  }
  vapp {
    properties = {
      "hostname" = "ubuntu-20-04",
      "password" = "VMware1!"
    }
  }
}
```

Notice that I'm adding a cd-rom that's mapped to a .iso on another datastore.

```hcl
resource "vsphere_virtual_machine" "ubuntu" {
 #... 
 cdrom {
     client_device  = false
     datastore_id = data.vsphere_datastore.iso_datastore.id
     path = "iso/linux/ubuntu/ubuntu-20.04.3-live-server-amd64.iso"
  }
 #... 
```

> **Note:** This is just an example. It's **not recommended** for this .ova as it will break customization via cloud-init. It's just for illustration purposes only.

```console
❯ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.ubuntu will be created
  + resource "vsphere_virtual_machine" "ubuntu" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datacenter_id                           = "datacenter-3"
      + datastore_id                            = "datastore-11"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "ubuntu64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = "host-10"
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 1024
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "ubuntu-20-04"
      + nested_hv_enabled                       = false
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 0

      + cdrom {
          + client_device  = false
          + datastore_id   = "datastore-12"
          + device_address = (known after apply)
          + key            = (known after apply)
          + path           = "iso/linux/ubuntu/ubuntu-20.04.3-live-server-amd64.iso"
        }

      + disk {
          + attach            = (known after apply)
          + controller_type   = (known after apply)
          + datastore_id      = (known after apply)
          + device_address    = (known after apply)
          + disk_mode         = (known after apply)
          + disk_sharing      = (known after apply)
          + eagerly_scrub     = (known after apply)
          + io_limit          = (known after apply)
          + io_reservation    = (known after apply)
          + io_share_count    = (known after apply)
          + io_share_level    = (known after apply)
          + keep_on_remove    = (known after apply)
          + key               = (known after apply)
          + label             = (known after apply)
          + path              = (known after apply)
          + size              = (known after apply)
          + storage_policy_id = (known after apply)
          + thin_provisioned  = (known after apply)
          + unit_number       = (known after apply)
          + uuid              = (known after apply)
          + write_through     = (known after apply)
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-16"
        }

      + ovf_deploy {
          + allow_unverified_ssl_cert = true
          + disk_provisioning         = "thin"
          + enable_hidden_properties  = false
          + ip_allocation_policy      = "STATIC_MANUAL"
          + ip_protocol               = "IPV4"
          + ovf_network_map           = {
              + "VM Network" = "network-16"
            }
          + remote_ovf_url            = "http://cloud-images.ubuntu.com/focal/current/focal-server-cloudimg-amd64.ova"
        }

      + vapp {
          + properties = {
              + "hostname" = "ubuntu-20-04"
              + "password" = "VMware1!"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.ubuntu: Creating...
vsphere_virtual_machine.ubuntu: Still creating... [10s elapsed]
........
vsphere_virtual_machine.ubuntu: Still creating... [4m30s elapsed]
vsphere_virtual_machine.ubuntu: Creation complete after 4m38s [id=42020b10-3b86-4ce5-00c5-aa0944ccaa79]
```

> **Note:** Because the client device was not used cloud-init did not customize this deployment, as expected; however, the requested .iso was attached as described in the configuration.

<img width="1214" alt="image" src="https://user-images.githubusercontent.com/7771363/151055477-7d652c3a-6a35-4429-af8c-2a5928dd6974.png">

What's illustrated in this last run is that the .iso file defined on the source datastore is, as defined and expected, automatically attached and connected when the VM is deployed from the .OVA file.

Ryan

cc @appilon for review and/or comment.